<a href="https://colab.research.google.com/github/kay-kay-t/CodingDojo/blob/main/01_SQL_Basics_Exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<center>
<img src="https://course_report_production.s3.amazonaws.com/rich/rich_files/rich_files/2470/s300/cd-logo-blue-600x600.png" alt="Coding Dojo Logo" class="center" height="50">

# SQL Basics Exercise

*Make a copy of this notebook to edit!*
```
File > Save a copy in Drive
```
    
</center>

[SQLAlchemy](https://www.sqlalchemy.org/) is a wrapper for Python that allows us to write SQL queries in Python. We will use this to practice our SQL basics in Python.

First, we need to connect to a database. We will just read a table into SQL for this step. We will be creating a [SQLite](https://sqlite.org/index.html) database and loading our [data](https://drive.google.com/file/d/18MgOmIHHafoubgp2d_7GM6GWroxb0vPe/view?usp=sharing) into that database.

The data (from [this source](https://data.world/sikkim/school)) describes details of various schools.

In [2]:
# imports
import pandas as pd
from sqlalchemy import create_engine

In [3]:
# load data - change the path to match your drive!
school = pd.read_csv('/content/drive/MyDrive/Data/School_Details.csv')
# make sure it loaded correctly
school.head(2)

  DistrictName EstablishmentCode  ... HighestClass BoardName
0         East             S0169  ...      Class 5       NaN
1         East             S0099  ...     Class 12  C.B.S.E.

[2 rows x 30 columns]

In [9]:
school. info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 30 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   DistrictName                1249 non-null   object
 1   EstablishmentCode           1249 non-null   object
 2   EstablishmentName           1249 non-null   object
 3   BRCName                     1249 non-null   object
 4   CRCName                     1249 non-null   object
 5   SchoolLevel                 1246 non-null   object
 6   ManagementName              1246 non-null   object
 7   LocalityHabitation          1221 non-null   object
 8   SubdivisionName             1241 non-null   object
 9   ConstituencyName            1249 non-null   object
 10  RevenueBlockName            1249 non-null   object
 11  CivicBodyName               1249 non-null   object
 12  WardName                    1249 non-null   object
 13  PostOfficeName              1249 non-null   object
 14  PhoneNo                     794 non-null    object
 15  FaxNo                       20 non-null     object
 16  EmailID                     182 non-null    object
 17  Website                     24 non-null     object
 18  LocatedInRuralOrUrban       1249 non-null   object
 19  DiseCode                    439 non-null    object
 20  EstablishedDate             1230 non-null   object
 21  DistrictHQDistance (in Km)  1246 non-null   float64
 22  CRCDistance (in Km)         1246 non-null   float64
 23  BACDistance (in Km)         1246 non-null   float64
 24  IsRecognized                1246 non-null   object
 25  RecognizedBy                1004 non-null   object
 26  ContactPersonName           0 non-null      float64
 27  LowestClass                 1246 non-null   object
 28  HighestClass                1246 non-null   object
 29  BoardName                   784 non-null    object
dtypes: float64(4), object(26)
memory usage: 292.9+ KB

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
# create sqlite engine
engine = create_engine('sqlite:///school.db', echo=True)
# create connection to engine
conn = engine.connect()

In [ ]:
# add the dataframe as a table in sqlite
sqlite_table = "school_details"
school.to_sql(sqlite_table, conn, if_exists='fail')

## SELECT & FROM

1. Get the EstablishmentName, SchoolLevel, and Website columns.

We can actually use Pandas to run SQL queries! To do this, we write a SQL query in a multi-line string. Simply replace the text in the multi-line string below with your SQL query and run the cell to query your data.

In [7]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName, SchoolLevel, Website 
FROM school_details
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 18:34:10,874 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName, SchoolLevel, Website
FROM school_details

2021-11-18 18:34:10,876 INFO sqlalchemy.engine.Engine [raw sql] ()

                                   EstablishmentName  ...                                    Website
0               BUDANG GOVERNMENT PRIMARY SCHOOL (E)  ...                                       None
1  CENTRAL PENDAM GOVERNMENT SENIOR SECONDARY SCHOOL  ...                                       None
2              CENTRAL POINT ACADEMY, CENTRAL PENDAM  ...  www.facebook.com/khanalkeshav (Group-CPA)
3      CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E)  ...                                       None
4                   DUGA GOVERNMENT SECONDARY SCHOOL  ...                                       None

[5 rows x 3 columns]

## WHERE

2. Display the EstablishmentName and DistrictHQDistance (in Km) for schools where the DistrictHQDistance (in Km) is more than 100 Km.

In [18]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName, "DistrictHQDistance (in Km)"
FROM school_details
WHERE "DistrictHQDistance (in Km)" > 100.0
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 18:46:11,422 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName, "DistrictHQDistance (in Km)"
FROM school_details
WHERE "DistrictHQDistance (in Km)" > 100.0

2021-11-18 18:46:11,428 INFO sqlalchemy.engine.Engine [raw sql] ()

                    EstablishmentName  DistrictHQDistance (in Km)
0  DODACHEN GOVERNMENT PRIMARY SCHOOL                       150.0
1   DEOLING GOVERNMENT PRIMARY SCHOOL                       107.0
2       PEMA TSEL ACADEMY(PHADAMCHEN)                       110.0
3    ZULUCK GOVERNMENT PRIMARY SCHOOL                       120.0
4   BHARENG GOVERNMENT PRIMARY SCHOOL                       150.0

3. Display the EstablishmentName, SchoolLevel, DistrictHQDistance (in Km) for schools where the school level is "JHS."

In [20]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE SchoolLevel = "JHS"
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 19:05:51,506 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE SchoolLevel = "JHS"

2021-11-18 19:05:51,510 INFO sqlalchemy.engine.Engine [raw sql] ()

                               EstablishmentName  ... DistrictHQDistance (in Km)
0  CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E)  ...                       60.0
1               PADMA KUMARI PUBLIC SCHOOL, DUGA  ...                       48.0
2           SAJONG GOVERNMENT JUNIOR HIGH SCHOOL  ...                       57.0
3      SINGLEYBONG GOVERNMENT JUNIOR HIGH SCHOOL  ...                       38.0
4                          SUNRISE ACADEMY, DUGA  ...                       47.0

[5 rows x 3 columns]

## Wildcards & LIKE

4. Display the EstablishmentName, SchoolLevel, DistrictHQDistance (in Km) for schools where the name of the school contains the words "JUNIOR HIGH."

In [24]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE EstablishmentName LIKE '%JUNIOR HIGH%'
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 19:18:59,311 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE EstablishmentName LIKE '%JUNIOR HIGH%'

2021-11-18 19:18:59,318 INFO sqlalchemy.engine.Engine [raw sql] ()

                               EstablishmentName  ... DistrictHQDistance (in Km)
0  CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E)  ...                       60.0
1           SAJONG GOVERNMENT JUNIOR HIGH SCHOOL  ...                       57.0
2      SINGLEYBONG GOVERNMENT JUNIOR HIGH SCHOOL  ...                       38.0
3          BORDANG GOVERNMENT JUNIOR HIGH SCHOOL  ...                       33.0
4     RANGPO BAZAR GOVERNMENT JUNIOR HIGH SCHOOL  ...                       47.0

[5 rows x 3 columns]

## LIMIT & ORDER BY

5. Display the EstablishmentName, SchoolLevel, DistrictHQDistance (in Km) for schools where the name of the school starts with the letter "C." Sort the results alphabetically by school name and limit the results of the query to 10 rows.

In [27]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE EstablishmentName LIKE 'C%'
ORDER BY EstablishmentName
LIMIT 10
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 19:24:07,796 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName, SchoolLevel, "DistrictHQDistance (in Km)"
FROM school_details
WHERE EstablishmentName LIKE 'C%'
ORDER BY EstablishmentName
LIMIT 10

2021-11-18 19:24:07,798 INFO sqlalchemy.engine.Engine [raw sql] ()

                             EstablishmentName  ... DistrictHQDistance (in Km)
0  C.M.RAI GOVERNMENT SECONDARY SCHOOL (OMCHU)  ...                       26.0
1                      CANAAN SCHOOL, RANIPOOL  ...                        0.0
2                  CANARY BIRD ACADEMY, KARTOK  ...                       38.0
3          CAROL ACADEMY, YANGSUM UPPER BERFOK  ...                       50.0
4      CENTRAL MARTAM GOVERNMENT JUNIOR SCHOOL  ...                       50.0

[5 rows x 3 columns]

6. Display the names of schools in urban areas. Sort the results in reverse alphabetical order.

In [28]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 19:32:37,274 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC

2021-11-18 19:32:37,276 INFO sqlalchemy.engine.Engine [raw sql] ()

                       EstablishmentName
0       ZULUCK GOVERNMENT PRIMARY SCHOOL
1       ZOOM GOVERNMENT SECONDARY SCHOOL
2  ZITLANG GOVERNMENT JUNIOR HIGH SCHOOL
3       ZINGLA GOVERNMENT PRIMARY SCHOOL
4                   ZENITH PUBLIC SCHOOL

## Aliasing

7. Repeat the previous query, but rename the column displayed to "name".

In [30]:
# Write your SQL query in this string
sql = """
SELECT EstablishmentName AS name
FROM school_details 
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 19:35:23,285 INFO sqlalchemy.engine.Engine
SELECT EstablishmentName AS name
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC

2021-11-18 19:35:23,287 INFO sqlalchemy.engine.Engine [raw sql] ()

                                    name
0       ZULUCK GOVERNMENT PRIMARY SCHOOL
1       ZOOM GOVERNMENT SECONDARY SCHOOL
2  ZITLANG GOVERNMENT JUNIOR HIGH SCHOOL
3       ZINGLA GOVERNMENT PRIMARY SCHOOL
4                   ZENITH PUBLIC SCHOOL

In [31]:
# Close the database connection
conn.close()